E2EClient/xml_template/AD/01_adjustment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://webservice" xmlns:m1="java:xml_soapadapter">
  <soapenv:Body>
<ns0:adjustment xmlns:ns0="http://webservice">
         <ns0:AdjustmentIN>
            <ns1:EventSource xmlns:ns1="java:xml_soapadapter"></ns1:EventSource>
            <ns1:Amount xmlns:ns1="java:xml_soapadapter">SW_AMT_XXXX</ns1:Amount>
            <ns1:Currency xmlns:ns1="java:xml_soapadapter">SW_CURR_XXXX</ns1:Currency>
            <ns1:AccountType xmlns:ns1="java:xml_soapadapter">SW_ADJ_ACCT_XXXX</ns1:AccountType>
            <ns1:Type xmlns:ns1="java:xml_soapadapter">SW_TYPE_XXXX</ns1:Type>
            <ns1:Status xmlns:ns1="java:xml_soapadapter">Submitted</ns1:Status>
            <ns1:StartDate xmlns:ns1="java:xml_soapadapter">SW_PVT_XXX</ns1:StartDate>
            <ns1:AdjustmentId xmlns:ns1="java:xml_soapadapter">SW_ADJ_ID_XXXX</ns1:AdjustmentId>
            <ns1:CreatedByLogin xmlns:ns1="java:xml_soapadapter">ANTONINIDA_CC_RM</ns1:CreatedByLogin>
            <ns1:Description xmlns:ns1="java:xml_soapadapter">X10</ns1:Description>
            <ns1:AdjustmentObjectId xmlns:ns1="java:xml_soapadapter">SW_ADJ_ID_XXXX</ns1:AdjustmentObjectId>
            <ns1:ReasonForRequest xmlns:ns1="java:xml_soapadapter">SW_RFREQ_XXXX</ns1:ReasonForRequest>
            <ns1:ProductCatalogueId xmlns:ns1="java:xml_soapadapter"/>
            <ns1:BillAccountCode xmlns:ns1="java:xml_soapadapter">SW_ACCT_AUTO_XXXX</ns1:BillAccountCode>
            <ns1:DaystoExpire xmlns:ns1="java:xml_soapadapter">SW_DAYS_EXP_XXXX</ns1:DaystoExpire>
         </ns0:AdjustmentIN>
      </ns0:adjustment> 
      </soapenv:Body>
</soapenv:Envelope>